Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/ant-omegat.tmx
Source language: en_us
Languages: pt_br

source: Tools
pt_br: Ferramentas

source: Supports writing of build scripts.
pt_br: Suporta escrita de scripts de construção.

source: The Ant module integrates Apache's Ant build tool into the IDE.
pt_br: O módulo Ant integra a ferramenta de build Apache Ant ao IDE.

source: Ant is a Java- and XML-based build tool, which you can use to write scripts to build, test, and deploy applications.
pt_br: O Ant é uma ferramenta de build baseada em Java e XML, que você usa para escrever scripts para construir, testar e implantar aplicativos.

source: Ant Module Settings
pt_br: Configurações do módulo Ant

source: Quiet
pt_br: Silencioso

source: Verbose
pt_br: Detalhado

source: Debug
pt_br: Depurar

source: Ant Settings
pt_br: Configurações do Ant

source: An&t Home:
pt_br: Home do An&t:

source: &Browse...
pt_br: Pro&curar...

source: &Save All Modified Files Before Running Ant
pt_br: &Salvar todos os arquivos alterados antes de executar o Ant

source: Re&use Output Tabs from Finished Processes
pt_br: Re&utilizar abas de saída de processos concluídos

source: Always Show &Output
pt_br: Sempre m&ostrar a saída

source: &Verbosity Level:
pt_br: Ní&vel de detalhamento:

source: Select
pt_br: Selecionar

source: {0} is not a valid Ant installation.
pt_br: {0} não é uma instalação válida do Ant.

source: It does not contain a file lib/ant.jar.
pt_br: Não há um arquivo lib/ant.jar.

source: &Default
pt_br: Pa&drão

source: Please wait...
pt_br: Aguarde...

source: &Properties:
pt_br: &Propriedades

source: Templates for creating Ant projects.
pt_br: Modelos para criação de projetos do Ant.

source: A custom Ant task.
pt_br: Uma tarefa do Ant personalizada

source: An empty Ant build script.
pt_br: Um scrpt de build do Ant vazio.

source: Ant Build Script
pt_br: Script de Build do Ant

source: Custom Ant Task
pt_br: Tarefa do Ant personalizada

source: Ant <project> XML files
pt_br: Arquivos XML <project> do Ant

source: Ant Scripts
pt_br: Scripts do Ant

source: MIME Type
pt_br: Tipo MIME

source: The MIME type used for Ant files in the IDE.
pt_br: O tipo MIME utilizado para arquivos Ant dentro do IDE.

source: The Ant MIME resolver recognizes this.
pt_br: O resolvedor Ant MIME reconhece isto.

source: You may only execute Ant scripts residing on disk.
pt_br: Você pode executar somente scripts Ant que estejam no disco.

source: Stop
pt_br: Parar

source: Re-run
pt_br: Re-executar

source: Building {0}...
pt_br: Construindo {0}...

source: BUILD SUCCESSFUL (total time: {0, choice, 0#| 1#1 minute | 2#{0} minutes }{1, choice, 0#0 seconds| 1#1 second| 2#{1} seconds})
pt_br: CONSTRUÍDO COM SUCESSO (tempo total: {0, choice, 0#| 1#1 minuto | 2#{0} minutos }{1, choice, 0#0 segundos| 1#1 segundo| 2#{1} segundos})

source: Finished building {0}.
pt_br: Construção concluída {0}.

source: BUILD FAILED (total time: {0, choice, 0#| 1#1 minute | 2#{0} minutes }{1, choice, 0#0 seconds| 1#1 second| 2#{1} seconds})
pt_br: CONSTRUÇÃO FALHOU (tempo total: {0, choice, 0#| 1#1 minuto | 2#{0} minutos }{1, choice, 0#0 segundos| 1#1 segundo| 2#{1} segundos})

source: Build of {0} failed.
pt_br: A execução de {0} falhou.

source: BUILD STOPPED (total time: {0, choice, 0#| 1#1 minute | 2#{0} minutes }{1, choice, 0#0 seconds| 1#1 second| 2#{1} seconds})
pt_br: CONSTRUÇÃO PARADA (tempo total: {0, choice, 0#| 1#1 minuto | 2#{0} minutos }{1, choice, 0#0 segundos| 1#1 segundo| 2#{1} segundos})

source: Build of {0} stopped.
pt_br: Execução de {0} parada.

source: &Stop Build/Run
pt_br: Parar con&strução/execução

source: &Stop Build/Run: {0}
pt_br: Parar con&strução/execução: {0}

source: &Stop Build/Run...
pt_br: Parar con&strução/execução...

source: Multiple build/run processes are running simultaneously.
pt_br: Estão sendo executados simultaneamente vários processos de construção/execução.

source: &Select the processes to stop:
pt_br: &Selecione os processos a serem parados:

source: Stop Build/Run
pt_br: Parar construção/execução

source: &Repeat Build/Run
pt_br: &Repetir construção/execução

source: Repeat Build/Run: {0}
pt_br: Repetir construção/execução: {0}

source: &Repeat Build/Run: {0}
pt_br: &Repetir construção/execução: {0}

source: {0} of {1}
pt_br: {0} de {1}

source: Add a &Toolbar Button
pt_br: Adicionar um bo&tão de barra de ferramentas

source: &Customize Generated Ant Code
pt_br: Personalizar &código do Ant gerado

source: Add a &Menu Item
pt_br: Adicionar um item de &menu

source: Make Keyboard Shortcut
pt_br: Criar atalho de teclado

source: Select an existing toolbar.
pt_br: Selecione uma barra de ferramentas existente.

source: A new button will be added to it which runs the shortcut.
pt_br: Um novo botão será adicionado àquele que executa o atalho.

source: Select Toolbar
pt_br: Selecionar barra de ferramentas

source: Press any key sequence in the supplied test area.
pt_br: Pressione qualquer seqüência de teclas na área de teste disponibilizada.

source: For example, hold down Control and Shift and press F12.
pt_br: Por exemplo, segure Ctrl e Shift e pressione F12.

source: The key sequence you choose will run the Ant shortcut.
pt_br: A seqüência de teclas que você escolheu irá executar o atalho do Ant.

source: Be sure to avoid conflicts with existing IDE keyboard shortcuts.
pt_br: Tenha certeza de que não há conflitos com atalhos já existentes no IDE.

source: (Choose Tools | Options and click Keymap to see existing shortcuts.)
pt_br: (Selecione ferramentas | Opções e clique em mapa de teclas para ver os atalhos existentes.)

source: Add to Toolbar
pt_br: Adicionar à barra de ferramentas

source: Customize Script
pt_br: Personalizar script

source: Add to Menu
pt_br: Adicionar ao menu

source: Choose Options
pt_br: Escolher opções

source: Select an existing menu.
pt_br: Selecionar um menu existente.

source: A new menu item will be added to it which runs the shortcut.
pt_br: Um novo item de menu será adicionado àquele que executa o atalho.

source: Select Menu
pt_br: Selecionar menu

source: (type here)
pt_br: (digite aqui)

source: Select Keyboard Shortcut
pt_br: Selecionar atalho de teclado

source: Add a &Keyboard Shortcut
pt_br: Adicionar um atalho de te&clado

source: Select how you want the shortcut to be invoked, as well as whether you want to customize the generated Ant mini-script.
pt_br: Selecione como você deseja que o atalho seja chamado, assim como se você deseja personalizar o mini-script Ant gerado.

source: Configure Basic Options
pt_br: Configure opções básicas

source: Customize the generated miniature Ant script below.
pt_br: Personalize, abaixo, o mini-script gerado do Ant.

source: Its default target will be run when the shortcut is invoked.
pt_br: Este alvo padrão será executado quando o atalho for chamado.

source: The project name may be used for display purposes, for example as the text of a menu item.
pt_br: O nome do projeto pode ser usado para exibição, por exemplo como o texto de um item de menu.

source: A typical customization would be to add nested <property name="name" value="value"/> elements to <ant/>.
pt_br: Uma personalização típica seria adicionar elementos <property name="name" value="value"/> aninhados em <ant/>.

source: Customize Generated Ant Script
pt_br: Personalizar o script gerado do Ant

source: This area contains Ant script code for customizing
pt_br: Esta área contém código de script Ant para personalização

source: Type a key sequence here
pt_br: Digite aqui uma sequência de teclas

source: Select in this list
pt_br: Selecione na lista

source: Select destination for shortcut
pt_br: Selecione o destino para o atalho

source: Select a menu item name:
pt_br: Selecione o nome de um item de menu:

source: Select toolbar button text:
pt_br: Selecione o texto para o botão da barra de ferramentas:

source: Create Shortcut to Ant Target
pt_br: Criar atalho para um alvo do Ant

source: <Ant not found: {0}>
pt_br: <Ant não encontrado: {0}>

source: ERROR - Ant is misconfigured and cannot be run.
pt_br: ERRO - O Ant está mal-configurado e não pode ser executado.

source: Ant Project
pt_br: Projeto do Ant

source: Properties of this Ant project file.
pt_br: Propriedades deste arquivo de projeto do Ant.

source: Project Name
pt_br: Nome do projeto

source: Name of the Ant project.
pt_br: Nome do projeto do Ant.

source: Default Target
pt_br: Alvo padrão

source: Which target in the project is run by default.
pt_br: O alvo do projeto que é executado como padrão.

source: {0} [Ant project]
pt_br: {0} [Projeto do Ant]

source: Anonymous Ant project
pt_br: Projeto do Ant anônimo

source: Run Target
pt_br: Executar alvo

source: Create Shortcut...
pt_br: Criar atalho...

source: Target Name
pt_br: Nome do alvo

source: A name by which to refer to this target.
pt_br: Um nome para se referir a este alvo.

source: Description
pt_br: Descrição

source: An end-user summary of what the target does, e.g. for usage summaries.
pt_br: Um resumo do que faz o alvo para usuários finais, por exemplo para resumos sobre a forma de uso.

source: Depends On
pt_br: Depende de

source: List of other targets that should be run before this target.
pt_br: Lista dos outros alvos que devem ser executados antes deste.

source: <Illegal depends>
pt_br: <Dependências ilegais>

source: <cannot parse>
pt_br: <não pode analisar>

source: Other Targets
pt_br: Outros alvos

source: Advanced...
pt_br: Avançado...

source: Run Ant Target
pt_br: Executar alvo do Ant

source: Run
pt_br: Executar

source: Cancel
pt_br: Cancelar

source: Select &target(s) to run:
pt_br: Selecionar &alvo(s) a executar:

source: Target description:
pt_br: Descrição do alvo:

source: Special Ant &properties:
pt_br: &Propriedades especiais do Ant:

source: &Verbosity level:
pt_br: Ní&vel de detalhamento:

source: Ant Targets
pt_br: Alvos do Ant

source: Displays targets in the current Ant build script.
pt_br: Mostra alvos no script Ant atual

source: Provides basic integration for the Apache Ant build tool in the IDE.
pt_br: Fornece integração básica para a ferramenta de construção Apache Ant dentro do IDE.

source: Includes support for editing Ant scripts and running targets.
pt_br: Inclui suporte para a edição de scripts Ant e execução de alvos.

source: Provides infrastructure for free-form Ant-based projects, and some special tasks used by Ant-based Java projects of several kinds.
pt_br: Fornece a infra-estrutura para projetos de forma livre baseados no Ant, e algumas tarefas especiais usadas por aplicações Java, baseadas em Ant, de vários tipos.

source: Support for Ant build scripts.
pt_br: Suporte para scripts de build do Ant.

source: Ant Debugger
pt_br: Depurador do Ant

source: Enables debugging on Ant scripts.
pt_br: Habilita a depuração em scripts do Ant.

source: The Ant Debugger module allows you to debug Ant scripts.
pt_br: O módulo depurador do Ant permite depurar scripts do Ant.

source: &Debug
pt_br: &Depurar

source: Debug Target
pt_br: Depurar alvo

source: Debug Ant Target
pt_br: Depurar alvo do Ant

source: Select &target(s) to debug:
pt_br: Selecione os &alvo(s) à depurar:

source: Disabled Conditional Breakpoint
pt_br: Ponto de interrupção condicional desabilitado

source: Disabled Breakpoint
pt_br: Ponto de interrupção desabilitado

source: Call Stack Line
pt_br: Linha da pilha de chamadas

source: Breakpoint
pt_br: Ponto de interrupção

source: Conditional Breakpoint
pt_br: Ponto de interrupção condicional

source: Current Program Counter
pt_br: Contador do programa atual

source: Current Target
pt_br: Alvo atual

source: Current Ant Target
pt_br: Alvo atual do Ant

source: Next Ant Target
pt_br: Próximo alvo do Ant

source: Web Browser Ant Task
pt_br: Tarefa Ant para navegador web

source: Adds an Ant task <nbbrowse> to run inside NetBeans to open a web browser.
pt_br: Adiciona uma tarefa do Ant <nbbrowse> que executa dentro do NetBeans e abre um navegador web.

source: Defines an Ant task, <nbbrowse>, which (when run inside NetBeans) will open your configured web browser on a URL.
pt_br: Define uma tarefa do Ant, <nbbrowse>, que (quando executada dentro do NetBeans) abre uma dada URL no navegador web configurado.

source: Helpful for making shortcut scripts that run some tests (e.g.) and then display HTML results.
pt_br: Útil na criação de scripts de atalho que executam alguns testes (por exemplo) e então mostram resultados em HTML.

source: <unknown>
pt_br: <desconhecido>

source: Stopping build of {0}...
pt_br: Parando contruçao de {0}...

source: Stopping build.
pt_br: Parando construção.

source: Stopping build of {0}...stopped.
pt_br: Parando construção de {0}... parado.

source: running...
pt_br: executando...

source: Input Handler
pt_br: Gerenciador de entradas

source: Input request was aborted by user.
pt_br: A requisição de entrada foi interrompida pelo usuário.

source: Enter input for the Ant script
pt_br: Forneça entradas para o script do Ant

source: Ant-Based Project Support
pt_br: Suporte para projetos baseados no Ant

source: Infrastructure
pt_br: Infra-estrutura

source: Supports all project types based on Ant as a build tool.
pt_br: Oferece suporte a todos os tipos de projetos baseados no Ant como ferramenta de construção.

source: Provides infrastructure and APIs for project types using the regular file layout and presumably doing Ant-based builds.
pt_br: Fornece infra-estrutura e APIs para tipos de projetos que usam a organização de arquivos padrão e que presumivelmente fazem builds baseados no Ant.

source: Cannot Write to File
pt_br: Não pode escrever no arquivo

source: Error parsing {0}: {1}
pt_br: Erro analisando {0}: {1}

source: An incompatible Xalan version has been detected on the IDE's classpath.
pt_br: Foi detectada uma versão incompatível do Xalan no classpath do IDE.

source: The IDE cannot start.
pt_br: O IDE não pôde ser iniciado.

source: Please see http://wiki.netbeans.org/wiki/view/FaqXalanOnCP for more information.
pt_br: Por favor veja http://wiki.netbeans.org/wiki/view/FaqXalanOnCP para maiores informações.

source: This file is used by a NetBeans-based IDE to track changes in generated files such as build-impl.xml.
pt_br: Este arquivo é utilizado por um IDE baseado no NetBeans para rastrear mudanças em arquivos gerados tais como o build-impl.xml.

source: Do not edit this file.
pt_br: Não edite este arquivo.

source: You may delete it but then the IDE will never regenerate such files for you.
pt_br: Você pode excluir isto mas então o IDE nunca irá gerar novamente tais arquivos a você.

source: Freeform Ant Projects
pt_br: Projetos de forma livre do Ant

source: Special project type for projects with preëxisting Ant scripts.
pt_br: Tipo de projeto especial para projetos com scripts Ant pré-existentes.

source: Permits the user to write a special project.xml file which describes the basic layout and functionality of an existing Ant-based project.
pt_br: Permite que o usuário escreva um arquivo project.xml especial, descrevendo o layout básico e a funcionalidade de um projeto existente baseado no Ant.

source: Supports defining mappings of Ant target to IDE actions, the locations of source folders, the layout of the logical view, and so on.
pt_br: Suporta a definição de mapeamentos de um alvo do Ant para ações do IDE , as localizações das pastas fontes, o layout da visão lógica e assim por diante.

source: Build
pt_br: Construir

source: Clean
pt_br: Limpar

source: Clean and Build
pt_br: Limpar e construir

source: Test
pt_br: Testar

source: Generate Javadoc
pt_br: Gerar Javadoc

source: Redeploy
pt_br: Reimplantar

source: Deploy
pt_br: Implantar

source: Errors in {0}
pt_br: Erros em {0}

source: Do not use Project Properties customizer when editing this file manually.
pt_br: Não use o customizador de propriedades do projeto ao editar este arquivo manualmente.

source: Script file {0} cannot be found.
pt_br: Arquivo de script {0} não encontrado.

source: Project Properties - {0}
pt_br: Propriedades do projeto - {0}

source: Browse Existing Ant Project Folder
pt_br: Examinar pasta de projeto Ant existente

source: Browse Existing Ant Build Script
pt_br: Examinar script Ant existente

source: Browse New Project Folder
pt_br: Examinar nova pasta de projeto

source: Select the folder that contains the project's files and specify the location of the build script.
pt_br: Selecione o diretório que contém os arquivos do projeto e especifique a localização do script de construção.

source: &Location:
pt_br: &Localização:

source: Build &Script:
pt_br: &Script de construção:

source: Specify a name and location for the new project.
pt_br: Especifique um nome e um local para o novo projeto.

source: Set as &Main Project
pt_br: Definir co&mo projeto principal

source: &Project Folder:
pt_br: Pasta do &projeto:

source: Project &Name:
pt_br: &Nome do projeto:

source: Bro&wse...
pt_br: Pro&curar...

source: Opens a file chooser to Browse for folder containing existing Ant-based project.
pt_br: Abre uma janela de escolha de arquivos para procurar por diretórios contendo um projeto existente baseado no Ant.

source: Br&owse...
pt_br: Pr&ocurar...

source: Opens a file chooser to browse for an existing Ant build script.
pt_br: Abre uma janela de escolha de arquivos para procurar um script Ant existente.

source: Brows&e...
pt_br: Pro&curar...

source: Opens a file chooser to Browse for the location of the project folder.
pt_br: Abre uma janela de escolha de arquivos para procurar o local do diretório do projeto.

source: You must specify the location of the project's files.
pt_br: Você deve especificar o lugar dos arquivos de projeto.

source: Project location does not exist.
pt_br: O local do projeto não existe.

source: You must specify an existing build script.
pt_br: Você deve especificar um script de construção existente.

source: The specified build script does not exist.
pt_br: O script de construção especificado não existe.

source: The selected file is not a valid Ant script.
pt_br: O arquivo selecionado não é um script Ant válido.

source: Project name must be set.
pt_br: Nome do projeto deve ser definido.

source: Project folder must be set.
pt_br: Pasta de projeto deve ser definido.

source: The selected project folder is already a NetBeans project.
pt_br: A pasta de projeto "{0}" selecionada já é um projeto do NetBeans.

source: Project folder is already owned by NetBeans project {0}.
pt_br: O diretório do projeto já pertence ao projeto do NetBeans {0}.

source: Project location is already owned by NetBeans project {0}.
pt_br: O local do projeto já pertence ao projeto do NetBeans {0}.

source: Project Folder displays location of project folder.
pt_br: A Pasta do Projeto exibe o local da pasta do projeto.

source: Specify Ant targets executed by common menu items.
pt_br: Especifica alvos do Ant executados por itens comuns de menu.

source: B&uild Project:
pt_br: Constr&uir projeto

source: &Clean Project:
pt_br: &Limpar projeto

source: &Generate Javadoc:
pt_br: &Gerar Javadoc:

source: &Run Project:
pt_br: Executa&r projeto

source: &Test Project:
pt_br: &Testar projeto

source: Custom Contextual &Menu Items:
pt_br: Itens de &menu personalizados:

source: &Add
pt_br: &Adicionar

source: Remo&ve
pt_br: Remo&ver

source: A table specifying custom build targets available from the contextual menu on the project node.
pt_br: Uma tabela que especifica alvos de build disponíveis a partir do menu de contexto no nó do projeto.

source: Adds new custom build target to the Custom Menu Items table.
pt_br: Adiciona um alvo personalizado à tabela itens de menu personalizados.

source: Removes selected custom target from the Custom Menu Items table.
pt_br: Remove o alvo personalizado da tabela de itens de menu personalizados.

source: Ant Target
pt_br: Alvo do Ant

source: Label
pt_br: Rótulo

source: General
pt_br: Geral

source: Build and Run
pt_br: Construir e executar

source: Name and Location
pt_br: Nome e local

source: Build and Run Actions
pt_br: Ações de construir e executar

source: Categories:
pt_br: Categorias:

source: No build target is associated with {0} action.
pt_br: Nenhum alvo de construção associado à ação {0}.

source: The free-form project requires a target representing the {0} action to invoke in your Ant script.
pt_br: O projeto de forma livre precisa de um alvo representando a ação {0} para invocar em seu script do Ant .

source: Select the target to invoke.
pt_br: Selecione o alvo a ser chamado.

source: Ant Code Completion
pt_br: Auto-completar de código do Ant

source: Code completion for textual editing of Ant scripts.
pt_br: Auto-completar de código para a edição textual de scripts Ant.

source: This module permits you to use code completion when editing Ant scripts in the NetBeans source editor.
pt_br: Este módulo permite a você usar o auto-completar de código ao editar scripts Ant no editor de código do NetBeans.

source: It will suggest attributes and subelements that can be added to the current element you are editing.
pt_br: O módulo sugere atributos e sub-elementos que podem ser adicionados ao elemento que você esta editando.

source: Completion knows about all standard Ant tasks and types, as well as custom-defined tasks and types, and works with nested data structures just as Explorer-based editing of Ant scripts does.
pt_br: O recurso auto-completar conhece todas as tarefas e tipos padrões do Ant, além de tarefas e tipos personalizados, e funciona com estruturas de dados aninhadas, da mesma forma que a edição de scripts do Ant no Explorer faz.

source: The module requires either the XML Text or XML Tree modules (or both) to be enabled.
pt_br: Este módulo requer ou o texto XML ou árvores de módulos XML (ou ambos) para ser habilitado.
